In [2]:
import pandas as pd

In [3]:
car_brands= pd.Series(["Honda", "Toyota", "BMW"])

In [4]:
car_brands

0     Honda
1    Toyota
2       BMW
dtype: object

In [5]:
gender= pd.Series(["Male","Female","Transexual"])
gender

0          Male
1        Female
2    Transexual
dtype: object

In [6]:
color=pd.Series(["Red","Blue","Green"])
color

0      Red
1     Blue
2    Green
dtype: object

In [7]:
car_data= pd.DataFrame({"Company":car_brands , "Color": color})
car_data

  Company  Color
0   Honda    Red
1  Toyota   Blue
2     BMW  Green

Importing a dataframe

In [8]:
car_sales = pd.read_csv("car-sales.csv.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [13]:
#exporting a dataframe
car_sales.to_csv("exported_car_sales.csv", index=False)
#index= false does not add the extra new column 
#of numbering when exporting

In [14]:
exported_car_sales= pd.read_csv("exported_car_sales.csv")

In [15]:
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00